{"class_name": "Model", "config": {"name": "model_51", "layers": [{"name": "input_32", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 336, 9, 1], "dtype": "float32", "sparse": false, "name": "input_32"}, "inbound_nodes": []}, {"name": "conv2d_83", "class_name": "Conv2D", "config": {"name": "conv2d_83", "trainable": true, "filters": 16, "kernel_size": [4, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"name": "activation_77", "class_name": "Activation", "config": {"name": "activation_77", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_83", 0, 0, {}]]]}, {"name": "conv2d_85", "class_name": "Conv2D", "config": {"name": "conv2d_85", "trainable": true, "batch_input_shape": [null, 336, 9, 1], "dtype": "float32", "filters": 16, "kernel_size": [312, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": "kernel_init", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"name": "dropout_37", "class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_77", 0, 0, {}]]]}, {"name": "activation_79", "class_name": "Activation", "config": {"name": "activation_79", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_85", 0, 0, {}]]]}, {"name": "conv2d_84", "class_name": "Conv2D", "config": {"name": "conv2d_84", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}, {"name": "conv2d_86", "class_name": "Conv2D", "config": {"name": "conv2d_86", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_79", 0, 0, {}]]]}, {"name": "dense_88_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 35], "dtype": "float32", "sparse": false, "name": "dense_88_input"}, "inbound_nodes": []}, {"name": "activation_78", "class_name": "Activation", "config": {"name": "activation_78", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_84", 0, 0, {}]]]}, {"name": "activation_80", "class_name": "Activation", "config": {"name": "activation_80", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_86", 0, 0, {}]]]}, {"name": "dense_88", "class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "batch_input_shape": [null, 35], "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_88_input", 0, 0, {}]]]}, {"name": "flatten_34", "class_name": "Flatten", "config": {"name": "flatten_34", "trainable": true}, "inbound_nodes": [[["activation_78", 0, 0, {}]]]}, {"name": "flatten_35", "class_name": "Flatten", "config": {"name": "flatten_35", "trainable": true}, "inbound_nodes": [[["activation_80", 0, 0, {}]]]}, {"name": "dense_89", "class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_88", 0, 0, {}]]]}, {"name": "concatenate_32", "class_name": "Concatenate", "config": {"name": "concatenate_32", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_34", 0, 0, {}], ["flatten_35", 0, 0, {}]]]}, {"name": "concatenate_33", "class_name": "Concatenate", "config": {"name": "concatenate_33", "trainable": true, "axis": -1}, "inbound_nodes": [[["dense_89", 0, 0, {}], ["concatenate_32", 0, 0, {}]]]}, {"name": "dense_90", "class_name": "Dense", "config": {"name": "dense_90", "trainable": true, "units": 216, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_33", 0, 0, {}]]]}, {"name": "reshape_22", "class_name": "Reshape", "config": {"name": "reshape_22", "trainable": true, "target_shape": [24, 9]}, "inbound_nodes": [[["dense_90", 0, 0, {}]]]}], "input_layers": [["dense_88_input", 0, 0], ["input_32", 0, 0]], "output_layers": [["reshape_22", 0, 0]]}, "keras_version": "2.1.3", "backend": "tensorflow"}