{
  "class_name": "Model",
  "config": {
    "name": "model_29",
    "layers": [
      {
        "name": "input_11",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            336,
            9,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_11"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_19",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_19",
          "trainable": true,
          "filters": 8,
          "kernel_size": [
            4,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_18",
        "class_name": "Activation",
        "config": {
          "name": "activation_18",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_19",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dropout_11",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_11",
          "trainable": true,
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        },
        "inbound_nodes": [
          [
            [
              "activation_18",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_32_input",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            35
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "dense_32_input"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_20",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_20",
          "trainable": true,
          "filters": 1,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dropout_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_32",
        "class_name": "Dense",
        "config": {
          "name": "dense_32",
          "trainable": true,
          "batch_input_shape": [
            null,
            35
          ],
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dense_32_input",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "activation_19",
        "class_name": "Activation",
        "config": {
          "name": "activation_19",
          "trainable": true,
          "activation": "relu"
        },
        "inbound_nodes": [
          [
            [
              "conv2d_20",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_33",
        "class_name": "Dense",
        "config": {
          "name": "dense_33",
          "trainable": true,
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dense_32",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "flatten_8",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_8",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "activation_19",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_8",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_8",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "dense_33",
              0,
              0,
              {}
            ],
            [
              "flatten_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_34",
        "class_name": "Dense",
        "config": {
          "name": "dense_34",
          "trainable": true,
          "units": 216,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "RandomNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "reshape_8",
        "class_name": "Reshape",
        "config": {
          "name": "reshape_8",
          "trainable": true,
          "target_shape": [
            24,
            9
          ]
        },
        "inbound_nodes": [
          [
            [
              "dense_34",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "dense_32_input",
        0,
        0
      ],
      [
        "input_11",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "reshape_8",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.1.3",
  "backend": "tensorflow"
}